// Напишите программу, которая на вход принимает значение, а на выходе показывает обратное значение.
// 1 -> 1
// 2 -> 0.5
// 0.25 -> 4

double a = 1;
Console.Write (a);
Console.Write (" -> ");
a = 1 / a;
Console.WriteLine (a);

double b = 2;
Console.Write (b);
Console.Write (" -> ");
b = 1 / b;
Console.WriteLine (b);

double c = 0.25;
Console.Write (c);
Console.Write (" -> ");
c = 1 / c;
Console.WriteLine (c);